In [3]:
%matplotlib inline
import pandas as pd

In [4]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [5]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                 title  year
0                Molly  1999
1     Hot Rods to Hell  1967
2        Lipstick (II)  2005
3  Shaolin vs. Vampire  1980
4          Iki yabanci  1966

In [29]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [6]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [7]:
titles.sort_values('year').head(2)

                    title  year
48078          Miss Jerry  1894
41071  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [10]:
len(titles[titles.title=='Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [11]:
len(titles[titles.title=="North by Northwest"])

1

### When was the first movie titled "Hamlet" made?

In [14]:
h = titles[titles.title=='Hamlet']
h.sort_values('year').head(2)

        title  year
31601  Hamlet  1910
51144  Hamlet  1911

### List all of the "Treasure Island" movies from earliest to most recent.

In [16]:
treasure_island = titles[titles.title=="Treasure Island"]
treasure_island = treasure_island.sort_values('year')
treasure_island

                  title  year
236222  Treasure Island  1918
119185  Treasure Island  1920
55875   Treasure Island  1934
157354  Treasure Island  1950
154870  Treasure Island  1972
95178   Treasure Island  1973
156349  Treasure Island  1985
117210  Treasure Island  1999

### How many movies were made in the year 1950?

In [17]:
len(titles[titles.year==1950])

1113

### How many movies were made in the year 1960?

In [18]:
len(titles[titles.year==1960])

1549

### How many movies were made from 1950 through 1959?

In [23]:
len(titles[(titles.year>=1950) & (titles.year <= 1959)])

12934

In [22]:
len(titles[titles.year // 10 == 195])

12934

### In what years has a movie titled "Batman" been released?

In [25]:
batman = titles[titles.title=="Batman"]
batman

         title  year
197741  Batman  1989
244615  Batman  1943

### How many roles were there in the movie "Inception"?

In [31]:
c = cast

In [35]:
len(cast[cast.title=="Inception"])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [38]:
c = cast[cast.title=="Inception"]
c = c[c.n.isnull()]
len(c)

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [42]:
c = cast[cast.title=="Inception"]
c = c[c.n.notnull()]
len(c)

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [46]:
c = cast[cast.title=="North by Northwest"]
c = c[cast.n.notnull()]
c = c.sort_values('n')
c

/home/yash/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [47]:
c = cast
c = c[c.title=="Sleuth"]
c = c.sort_values('n')
c

,title,year,name,type,character,n
326774,Sleuth,2007,Michael Caine,actor,Andrew,1.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
1293634,Sleuth,2007,Jude Law,actor,Milo,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1805907,Sleuth,2007,Harold Pinter,actor,Man on T.V.,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
260242,Sleuth,2007,Kenneth Branagh,actor,Other Man on T.V.,NaN
373877,Sleuth,2007,Alec (II) Cawthorne,actor,Inspector Doppler,NaN
2724552,Sleuth,2007,Eve (II) Channing,actress,Marguerite Wyke,NaN
3370424,Sleuth,2007,Carmel O'Sullivan,actress,Maggie,NaN

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [48]:
c = cast
c = c[(c.title=="Sleuth") & (c.year==2007)]
c = c.sort_values('n')
c

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [52]:
c = cast
c = c[(c.title=="Hamlet") & (c.year==1921)]
len(c)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [53]:
c = cast
c = c[(c.title=="Hamlet") & (c.year==1996)]
len(c)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [54]:
c = cast
c = c[(c.title=="Hamlet")]
len(c)

342

### How many people have played an "Ophelia"?

In [56]:
c = cast
c = c[c.character =="Ophelia"]
len(c)

117

### How many people have played a role called "The Dude"?

In [57]:
c = cast
c = c[c.character == "The Dude"]
len(c)

19

### How many people have played a role called "The Stranger"?

In [58]:
c = cast
c = c[c.character == "The Stranger"]
len(c)

212

### How many roles has Sidney Poitier played throughout his career?

In [62]:
c = cast
c = c[c.name=="Sidney Poitier"]
len(c)

43

### How many roles has Judi Dench played?

In [63]:
c = cast
c = c[c.name=="Judi Dench"]
len(c)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [64]:
c = cast
c = c[c.name=="Cary Grant"]
c = c[c.n ==2]
c = c[c.year // 10 == 194]
c

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [67]:
c = cast
c = c[c.name=="Cary Grant"]
c = c[c.n ==1]
c = c[c.year // 10 == 194]
c = c.sort_values('year')
c

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [69]:
c = cast
c = c[c.type=="actor"]
c = c[c.year // 10 == 195]
len(c)

157738

### How many roles were available for actresses in the 1950s?

In [71]:
c = cast
c = c[c.type=="actress"]
c = c[c.year // 10 == 195]
len(c)

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [73]:
c = cast
c = c[c.n ==1]
c = c[c.year <= 1980]
len(c)

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [74]:
c = cast
c = c[c.n !=1]
c = c[c.year <= 1980]
len(c)

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [76]:
c = cast
c = c[c.n.isnull()]
c = c[c.year <= 1980]
len(c)

448347